import * as motion from "motion/react-client";
import { fadeInAnimation } from "@/utils/animationVariants";
import Container from "../shared/container/Container";
import PublicContractBlock from "./PublicContractBlock";
import { EMAIL_CLIENTS, PHONE } from "@/constants/constants";
import { contactsPhoneRegex } from "@/regex/regex";

export default function PublicContract() {
  const listOne = [
    "1.1. Публічна оферта (далі - «Оферта») - публічна пропозиція Продавця, адресована невизначеному колу осіб, укласти з Продавцем договір купівлі-продажу товару дистанційним способом (далі - «Договір») на умовах, що містяться в цій Оферті.",
    "1.2. Товар або Послуга – об'єкт угоди сторін, який був обраний покупцем на сайті Інтернет-магазину та поміщений у кошик, або вже придбаний Покупцем у Продавця дистанційним способом.",
    "1.3. Інтернет-магазин – сайт Продавця за адресою https://www.glimmer.com.ua створений для укладення договорів роздрібної та оптової купівлі-продажу на підставі ознайомлення Покупця із запропонованим Продавцем описом Товару за допомогою мережі Інтернет.",
    "1.4. Покупець – дієздатна фізична особа, яка досягла 18 років, отримує інформацію від Продавця, розміщує замовлення щодо купівлі товару, що представлений на сайті Інтернет-магазину для цілей, що не пов'язані зі здійсненням підприємницької діяльності, або юридична особа чи фізична особа-підприємець.",
    "Продавець – Фізична особа підприємець Кальницька Ольга Юріївна, яка створена і діє відповідно до чинного законодавства України та здійснює господарську діяльність у відповідності до реєстраційних документів.",
  ];

  const listTwo = [
    "2.1. Продавець зобов’язується передати у власність Покупцю Товар, а Покупець зобов’язується оплатити і прийняти Товар на умовах цього Договору.",
    "2.2. Датою укладення договору-оферти (акцептом оферти) та моментом повного й беззаперечного прийняттям замовником умов договору вважається дата заповнення форми замовлення, розташованої на Інтернет-сайті та його оплати.",
  ];

  const listThree = [
    "3.1. Покупець самостійно оформлює замовлення на відповідній сторінці Інтернет-сайту https://www.glimmer.com.ua, за допомогою платіжної системи натисканням кнопки «Оформити», «Оплатити», «Замовити» та інш., або зробивши замовлення по електронній пошті чи за номером телефону служби підтримки, вказаним в розділі контактів Інтернет-сайту.",
    "3.2. Продавець має право відмовитися від передання замовлення Покупцеві у випадку, якщо відомості, вказані Покупцем під час оформлення замовлення, є неповними або викликають підозру щодо їх дійсності.",
    "3.3. При оформленні замовлення на сайті Інтернет-магазину Покупець зобов'язується надати наступну обов’язкову інформацію, необхідну Продавцю для виконання замовлення:",
    "3.3.1. прізвище, ім'я Покупця, електронну адресу;",
    "3.3.2. адреса, за якою слід доставити Товар (якщо доставка до адреси Покупця);",
    "3.3.3. контактний телефон.",
    "3.3.4. Ідентифікаційний код для юридичної особи або фізичної-особи підприємця.",
    "3.4. Найменування, кількість, артикул, ціна обраного Покупцем Товару вказуються в кошику Покупця на сайті Інтернет-магазину.",
    "3.5. Якщо будь-якої із Сторін договору необхідна додаткова інформація, він має право запросити її у іншій Стороні. У разі ненадання необхідної інформації Покупцем, Продавець не несе відповідальності за надання якісної послуги Покупцю при покупці товару в інтернет-магазині.",
    "3.6. При оформленні замовлення через оператора Продавця (п. 3.1. Цієї Оферти) Покупець зобов'язується надати інформацію, зазначену в п. 3.3 – 3.4. цієї Оферти.",
    "3.7. Ухвалення Покупцем умов цієї Оферти здійснюється за допомогою внесення Покупцем відповідних даних в реєстраційну форму на сайті Інтернет-магазину або при оформленні Замовлення через оператора. Після оформлення Замовлення через Оператора дані про Покупця вносяться до бази даних Продавця.",
    "3.8. Покупець несе відповідальність за достовірність наданої інформації при оформленні Замовлення.",
    "3.9. Укладаючи Договір, тобто акцептуючи умови даної пропозиції (запропоновані умови придбання Товару), шляхом оформлення Замовлення, Покупець підтверджує наступне: а) Покупець цілком і повністю ознайомлений, і згоден з умовами цієї пропозиції (оферти); б) він дає дозвіл на збір, обробку та передачу персональних даних, дозвіл на обробку персональних даних діє протягом усього терміну дії Договору, а також протягом необмеженого терміну після закінчення його дії. Крім цього, укладенням договору Покупець підтверджує, що він повідомлений (без додаткового повідомлення) про права, встановлених Законом України 'Про захист персональних даних', про цілі збору даних, а також про те, що його персональні дані передаються Продавцю з метою можливості виконання умов цього Договору, можливості проведення взаєморозрахунків, а також для отримання рахунків, актів та інших документів. Покупець також погоджується з тим, що Продавець має право надавати доступ та передавати його персональні дані третім особам без будь-яких додаткових повідомлень Покупця з метою виконання замовлення Покупця. Обсяг прав Покупця, як суб'єкта персональних даних відповідно до Закону України 'Про захист персональних даних' йому відомий і зрозумілий.",
    "3.10. Строк обробки Продавцем замовлення – до 3-х (трьох) робочих днів з моменту його оформлення на Сайті.",
  ];

  const listFour = [
    "4.1 Ціни на Товари та послуги визначаються Продавцем самостійно та вказані на сайті Інтернет-магазину. Всі ціни на Товари та послуги вказані на сайті у національній валюті України – гривні.",
    "4.2 Ціни на Товари та послуги можуть змінюватися Продавцем в односторонньому порядку залежно від кон'юнктури ринку. При цьому ціна окремої одиниці Товару, вартість якої оплачена Покупцем в повному обсязі, не може бути змінена Продавцем в односторонньому порядку.",
    "4.3. Вартість Товару, яка вказана на сайті Інтернет-магазину не включає в себе вартість доставки Товару Покупцю. Вартість доставки Товару Покупець сплачує відповідно до діючих тарифів служб доставки (перевізників) безпосередньо обраній ним службі доставки (перевізнику).",
    "4.4. Вартість Товару яка вказана на сайті Інтернет-магазину не включає в себе вартість доставки Товару на адресу Покупця.",
    "4.5. Продавець може вказати орієнтовну вартість доставки Товару на адресу Покупця під час звернення Покупця із відповідним запитом до Продавця шляхом надіслання листа на електронну пошту або при оформленні замовлення через оператора інтернет-магазину.",
    "4.6. Зобов'язання Покупця по оплаті Товару вважаються виконаними з моменту надходження Продавцю коштів на його рахунок.",
    "4.7. Розрахунки між Продавцем і Покупцем за Товар здійснюються способами, зазначеними на сайті Інтернет-магазину в розділі «Оплата і Доставка».",
    "4.8. При отриманні товару Покупець повинен у присутності представника служби доставки (перевізника) перевірити відповідність Товару якісним і кількісним характеристикам (найменування товару, кількість, комплектність, термін придатності).",
    "4.9. Покупець або його представник під час приймання Товару підтверджує своїм підписом в товарному чеку/ або в замовленні/ або в транспортній накладній на доставку товарів, що не має претензій до кількості товару, зовнішнього вигляду та комплектності товару.",
    "4.10. Право власності та ризик випадкової втрати або пошкодження Товару переходить до Покупця або його Представника з моменту отримання Товару Покупцем в місті поставки Товару при самостійній доставки Товару від Продавця, чи під час передачі Продавцем товару службі доставки (перевізнику) обраної Покупцем.",
    "4.11. Остаточною є ціна, зазначена у віртуальному кошику при оформленні замовлення та/або під час оплати вартості Товарів за допомогою запропонованої платіжної системи.",
    "4.12. Розрахунки між Сторонами відповідно до умов цього Договору здійснюються у національній валюті України одним із зазначених способів: • шляхом перерахування Покупцем відповідної грошової суми на поточний рахунок Продавця у відповідності з банківськими реквізитами, зазначеними у рахунку на оплату відповідного Замовлення, наданого/надісланого Покупцю Продавцем; • шляхом безготівкового розрахунку в Інтернет-магазині за допомогою платіжної системи.",
  ];

  const listFive = [
    "5.1. Продавець зобов’язаний:",
    "5.1.1. Передати Покупцеві товар у відповідності до умов цього Договору та замовлення Покупця.",
    "5.1.2. Не розголошувати будь-яку приватну інформацію про Покупця і не надавати доступ до цієї інформації третім особам, за винятком випадків, передбачених законодавством та під час виконання Замовлення Покупця.",
    "5.2. Продавець має право:",
    "5.2.1 Змінювати умови цього Договору, а також ціни на Товари та послуги, в односторонньому порядку, розміщуючи їх на сайті Інтернет-магазину. Всі зміни набувають чинності з моменту їх публікації.",
    "5.2.2 В односторонньому порядку призупинити передання товару або надання послуг за цим договором у випадку порушення замовником умов цього договору.",
    "5.2.3 В односторонньому порядку визначити вартість продукту.",
    "5.2.4 Інші права відповідно до чинного законодавства України та цього договору.",
    "5.3 Покупець зобов'язується:",
    "5.3.1 До моменту укладення Договору ознайомитися зі змістом Договору, умовами Договору і цінами, запропонованими Продавцем на сайті Інтернет-магазину.",
    "5.3.2 На виконання Продавцем своїх зобов'язань перед Покупцем останній повинен повідомити всі необхідні дані, що однозначно ідентифікують його як Покупця, і достатні для доставки Покупцеві замовленого Товару.",
    "5.4. Покупець має право:",
    "5.4.1 Оформити замовлення товару, зазначеного на відповідній сторінці інтернет-сайту;",
    "5.4.2 Вимагати від виконавця надання даного продукту відповідно до умов цього договору;",
    "5.4.3 Інші права відповідно до чинного законодавства України та цього договору.",
    "5.4.4 Покупець користується всіма правами споживача відповідно до чинного законодавства України, що регулює дані правовідносини.",
    "5.5. Покупцю забороняється:",
    "5.5.1 Копіювати та поширювати будь-яким способом даний товар отриманий в рамках цієї оферти;",
    "5.5.2 Здійснювати свою діяльність на основі товару виконавця;",
    "5.5.3 Допускати поширення недостовірної, неправдивої інформації, інформації, що ганьбить честь, гідність, ділову репутацію Продавця, а також інформації, що спонукає і закликає до міжнаціональної, етнічної, статевої, расової нетерпимості, ворожнечі, війни, зміни державного устрою країн, інформації, поширення якої заборонено чинним законодавством України та нормами міжнародного права в залежності від території надання послуг.",
  ];

  const listSix = [
    "6.1 Поверненню не підлягають товари належної якості, зазначені в Переліку непродовольчих товарів, що не підлягають поверненню, затвердженому Постановою Кабінету Міністрів України від 19.03.1994 № 172. (друкована продукція, аудіо та відеоносії інформації).",
    "6.2 Обмін та повернення Товару здійснюється відповідно до Закону України «Про захист прав споживачів» № 1024-XII від 12.05.1991 (зі змінами та доповненнями).",
    "6.3 Покупець має право відмовитися від отриманого Товару протягом 14 (чотирнадцяти) днів з моменту отримання такого Товару виключно за умови, що збережено товарний вигляд, споживчі властивості Товару, фабричну упаковку, ярлики та розрахунковий документ (електронний документ, квитанцію, товарний чи фіскальний чек, квиток, талон або інший документ, що підтверджує факт отримання коштів, із зазначенням дати здійснення розрахунку).",
    "6.4 Згідно з ч. 1 ст. 9 Закону України «Про захист прав споживачів» від 12 травня 1991 року № 1023-XII та відповідно до Постанови КМУ № 172 «Про реалізацію окремих положень Закону України «Про захист прав споживачів» від 19 березня 1994 року, косметичні засоби та парфумерні вироби належної якості, продаж яких здійснюється в Інтернет-магазині, відносяться до категорії «Парфюмерно-косметичні вироби», що не підлягають обміну або поверненню.",
    "6.5 Якщо товар повертається Покупцем з причини затримки відправлення замовлення з вини Продавця та втрати актуальності такого товару для Покупця, та/або у випадку невідповідності отриманих товарних позицій оформленому Покупцем замовленню, та/або у випадку виявлення Покупцем суттєвих недоліків товару, що свідчать про його неналежну якість, – послуги кур’єра або служби доставки при обміні або поверненні такого товару оплачує Продавець. У всіх інших випадках послуги доставки при обміні та поверненні товару оплачує Покупець.",
  ];

  const listSeven = [
    "7.1. Продавець не несе відповідальності за шкоду, заподіяну Покупцеві або третім особам внаслідок неналежного монтажу, використання, зберігання Товару придбаного у Продавця.",
    "7.2. Продавець не несе відповідальності за неналежне, несвоєчасне виконання Замовлень і своїх зобов’язань у випадку надання Покупцем недостовірної або помилкової інформації.",
    "7.3. Продавець і Покупець несуть відповідальність за виконання своїх зобов'язань відповідно до чинного законодавства України і положень цього Договору.",
    "7.4. Продавець або Покупець звільняються від відповідальності за повне або часткове невиконання своїх зобов'язань, якщо невиконання є наслідком форс-мажорних обставин як: війна або військові дії, землетрус, повінь, пожежа та інші стихійні лиха, що виникли незалежно від волі Продавця і / або Покупця після укладення цього договору. Сторона, яка не може виконати свої зобов'язання, негайно повідомляє про це іншу Сторону.",
  ];

  const listEight = [
    "8.1. Надаючи свої персональні дані на сайті Інтернет-магазину при реєстрації або оформленні Замовлення, Покупець надає Продавцеві свою добровільну згоду на обробку, використання (у тому числі і передачу) своїх персональних даних, а також вчинення інших дій, передбачених Законом України «Про захист персональних даних», без обмеження терміну дії такої згоди.",
    "8.2. Продавець зобов'язується не розголошувати отриману від Покупця інформацію. Не вважається порушенням надання Продавцем інформації контрагентам і третім особам, що діють на підставі договору з Продавцем, в тому числі і для виконання зобов'язань перед Покупцем, а також у випадках, коли розкриття такої інформації встановлено вимогами чинного законодавства України.",
    "8.3. Покупець несе відповідальність за підтримання своїх персональних даних в актуальному стані. Продавець не несе відповідальності за неякісне виконання або невиконання своїх зобов'язань у зв'язку з неактуальністю інформації про Покупця або невідповідністю її дійсності.",
  ];

  const listNine = [
    "9.1. Договір вступає в дію з моменту оплати Покупцем товару на сайті.",
    "9.2. Якщо будь-яке положення (частина) Договору є або стає недійсним з будь-яких підстав, цей факт не впливає на дійсність інших положень оферти в цілому.",
    "9.3. Покупець гарантує, що всі умови цього договору йому зрозумілі і він приймає їх безумовно і в повному обсязі.",
    "9.4. З питань, що не є врегульованими цим договором, сторони зобов’язуються керуватися нормами чинного законодавства України.",
    "9.5. Відповідно до Постанови Кабінету Міністрів України № 172 від 19 березня 1994 року «Про реалізацію окремих положень Закону України «Про захист прав споживачів» товар, який реалізується на Сайті підпадає під перелік товарів Додатку №3 цієї Постанови, а саме перелік товарів належної якості, що не підлягає обміну (поверненню).",
  ];

  const sellerData = [
    "ФОП Кальницька Ольга Юріївна",
    "IBAN UA953220010000026009360035595",
    "ІПН/ЄДРПОУ 3795105849",
    "Акціонерне товариство УНІВЕРСАЛ БАНК",
    "МФО 322001",
    "ЄДРПОУ Банку 21133352",
    `Тел.: ${PHONE.replace(contactsPhoneRegex, "+38 ($1) $2 $3 $4")}`,
    `e-mail: ${EMAIL_CLIENTS}`,
  ];

  return (
    <section className="pt-13 xl:pt-[59px] pb-20 xl:pb-[140px]">
      <Container>
        <motion.h1
          initial="hidden"
          whileInView="visible"
          exit="exit"
          viewport={{ once: true, amount: 0.2 }}
          variants={fadeInAnimation({ y: 30 })}
          className="mb-6 xl:mb-8 text-[22px] xl:text-[32px] font-medium leading-[120%] uppercase text-center"
        >
          Публічний договір інтернет-магазину Glimmer
        </motion.h1>
        <motion.h2
          initial="hidden"
          whileInView="visible"
          exit="exit"
          viewport={{ once: true, amount: 0.2 }}
          variants={fadeInAnimation({ y: 30 })}
          className="mb-10 xl:mb-14"
        >
          <p className="mb-2 xl:mb-3 text-[14px] xl:text-[18px] font-medium leading-[120%] uppercase text-center">
            ПУБЛІЧНИЙ ДОГОВІР (ОФЕРТА)
          </p>
          <p className="text-[12px] xl:text-[16px] font-medium leading-[120%] text-center">
            на замовлення, купівлю-продаж і доставку товарів
          </p>
        </motion.h2>
        <motion.p
          initial="hidden"
          whileInView="visible"
          exit="exit"
          viewport={{ once: true, amount: 0.2 }}
          variants={fadeInAnimation({ y: 30 })}
          className="mb-7 xl:mb-10 text-[14px] xl:text-[16px] font-normal leading-[160%]"
        >
          Цей договір є офіційною та публічною пропозицією Продавця укласти
          договір купівлі-продажу Товару, представленого на сайті
          https://www.glimmer.com.ua. Даний договір є публічним, тобто
          відповідно до статті 633 Цивільного кодексу України, його умови є
          однаковими для всіх покупців незалежно від їх статусу (фізична особа,
          юридична особа, фізична особа-підприємець) без надання переваги одному
          покупцю перед іншим. Шляхом укладення цього Договору покупець в
          повному обсязі приймає умови та порядок оформлення замовлення, оплати
          товару, доставки товару, повернення товару, відповідальності за
          недобросовісне замовлення та усі інші умови договору. Договір
          вважається укладеним з моменту натискання кнопки «Підтвердити
          Замовлення» на сторінці оформлення замовлення в Розділі «Кошик» і
          отримання Покупцем від Продавця підтвердження замовлення в
          електронному вигляді.
        </motion.p>
        <div className="flex flex-col gap-6">
          <PublicContractBlock title="1. Визначення термінів" list={listOne} />
          <PublicContractBlock title="2. Предмет Договору" list={listTwo} />
          <PublicContractBlock
            title="3. Оформлення Замовлення"
            list={listThree}
          />
          <PublicContractBlock
            title="4. Ціна і Доставка Товару"
            list={listFour}
          />
          <PublicContractBlock
            title="5. Права та обов’язки Сторін"
            list={listFive}
          />
          <PublicContractBlock title="6. Повернення Товару" list={listSix} />
          <PublicContractBlock title="7. Відповідальність" list={listSeven} />
          <PublicContractBlock
            title="8. Конфіденційність і захист персональних даних"
            list={listEight}
          />
          <PublicContractBlock title="9. Інші умови" list={listNine} />
          <PublicContractBlock
            title="КОНТАКТНІ ДАНІ ПРОДАВЦЯ"
            list={sellerData}
          />
        </div>
      </Container>
    </section>
  );
}
